febacook/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "birthday", "gender", "pronouns", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save!