febacook/app/models/user.rb

    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]

    def password=(password)
        @password = password
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("username", "email", "first_name", "last_name", "birthday", "gender", "pronouns", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def reset_session_token!
        self.update!(session_token: SecureRandom.urlsafe_base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "aat2tbVtlXnd_J3d25-gqw"], ["updated_at", "2020-03-03 23:20:18.369883"], ["id", 3]]